In [1]:
"Python for Data Ananlysis \
Chapet 5 : Getting Started with pandas"

'Python for Data Ananlysis Chapet 5 : Getting Started with pandas'

In [13]:
"""
Pandas is designed for working with tabular or heterogeneous data.

"""

import pandas as pd; from pandas import Series, DataFrame; import numpy as np

In [14]:
"""
# Series a 1D array-like object containing a sequence of values (similar to NymPy types)
and and associated array of data labels, called its index.
The simplest Series is formed from only an array of data

"""


obj = pd.Series([2,4,5,-2,3])

display(obj)

# Creating a Series with an Index

index_obj = pd.Series([5, 6, 3, 4], index=['a','r','s','c'])

display(index_obj)

# You can use labels in the index when selecting single values or set values:

display(index_obj['a'])

index_obj['c'] = 4

display(index_obj['c'])


# Here ['a','c','r'] is interpreted as a list of indices,
#even though it cointains strings instead of integers.
display(index_obj[['a','c','r']])


# Using NumPy-like operations, such as filtering with aboolean array,

# scalar multiplication, or applying math functions, will perserve the index-value link

display(index_obj[index_obj > 1])

display(index_obj * 3)

0    2
1    4
2    5
3   -2
4    3
dtype: int64

a    5
r    6
s    3
c    4
dtype: int64

5

4

a    5
c    4
r    6
dtype: int64

a    5
r    6
s    3
c    4
dtype: int64

a    15
r    18
s     9
c    12
dtype: int64

In [15]:
"""
Another way to use a Series is as a fixed-legth, ordered dict, as it is a mapping of index values
to data values. It can be used in many ways in many contexts where you migth use a dict
"""

'b' in index_obj

# If you have data in a Py dict, you can create A series from it bu passing the dict

statesNdict = {'ohio' : 35000, 'Texas' : 71000, 'Oregon': 10000, 'Utah' : 50000}

statesNdict2= {'Conocrd' : 35000, 'Texas' : 71000, 'Oregon': 10000, 'Marco' : 50000}

obj3 = pd.Series(statesNdict)

obj2= pd.Series(statesNdict2)

#isplay(statesNdict)

# A useful Series feature for many applicatios is 
# that it automatically aligns by index label in arithmetic operations.

obj3+ obj2

Conocrd         NaN
Marco           NaN
Oregon      20000.0
Texas      142000.0
Utah            NaN
ohio            NaN
dtype: float64

In [16]:
"""
Both the Series object itself and its index have a name attribute, which integrates with other key
areas of pandas fuctionality:
"""

obj3.name = 'population'
obj3.index.name = 'state'

# A Series's index can be altered in-place by assignment:

obj.index = ['Kav', 'Ant', 'Russ','Jeff', 'JV']

obj

Kav     2
Ant     4
Russ    5
Jeff   -2
JV      3
dtype: int64

In [30]:
"""

# DataFrame 
A rectangular table of data and contains an ordered collections of columns, each of which can be a 
different value type(numeric, string, boolean). The DataFrame had both a row and column index;
it can be thougth of as a dict of Series all sharing the same index.
One can use DF to represent higher DIMs data in a tabular format using hierarchial indexing.
"""

# Creating a DF from a dict of equal-leght lists or NumPy arrays:

df_Style = {'state':['Ohio', 'Nevada', 'New York', 'Kansas', 'Texas'],
            'year' : [2019, 2020, 2021, 2022, 2023], 
            'value': [1.5, 2.6, 1.9, 9.4, 2.1]}
    
frame = pd.DataFrame(df_Style)

display(frame)

# If you specify a sequence of columns, the DataFrames columns will be arranged in that order

pd.DataFrame(df_Style, columns=['value', 'state', 'year'])

# A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute

display(frame['year'])

# frame.column only works when the column name is a valid Py variable name.

(frame.year)

# Note that the returned Series have the same index as the DF,
# and their name attribute has been appropriately set.

# Rows can aslo be retruved by position on name with special attribute loc

display(frame.loc[2])

# Columns can be modified and added by assigment. for example,
# the 'debt' column could be created and its value assigned a scalar valu3
frame['Todday'] = [5, 4, 3, 2, 1]

display(frame)


frame['tomorrow'] = np.arange(5,)

display(frame)


# When assinging lists | arrays to a column the value's length must match the length of the DF
# If assingn a Series its labels will be realigned exactly to the DF index, inserting NaN values in any hole.


vid = pd.Series([-5.9, -4.2, -6.8], index=['two', 'four', 'five'])

frame['debt'] = vid

display(frame)

# The del keyword will delete columns as with a dict.

frame['east'] = frame.state == 'Ohio'

display(frame)

del frame['east']

display(frame.columns)

# The column returned from indexing a DF is a view on the underlying data, not a copy! 

# The column can be copied with copy method

      state  year  value
0      Ohio  2019    1.5
1    Nevada  2020    2.6
2  New York  2021    1.9
3    Kansas  2022    9.4
4     Texas  2023    2.1

0    2019
1    2020
2    2021
3    2022
4    2023
Name: year, dtype: int64

state    New York
year         2021
value         1.9
Name: 2, dtype: object

      state  year  value  Todday
0      Ohio  2019    1.5       5
1    Nevada  2020    2.6       4
2  New York  2021    1.9       3
3    Kansas  2022    9.4       2
4     Texas  2023    2.1       1

      state  year  value  Todday  tomorrow
0      Ohio  2019    1.5       5         0
1    Nevada  2020    2.6       4         1
2  New York  2021    1.9       3         2
3    Kansas  2022    9.4       2         3
4     Texas  2023    2.1       1         4

      state  year  value  Todday  tomorrow  debt
0      Ohio  2019    1.5       5         0   NaN
1    Nevada  2020    2.6       4         1   NaN
2  New York  2021    1.9       3         2   NaN
3    Kansas  2022    9.4       2         3   NaN
4     Texas  2023    2.1       1         4   NaN

      state  year  value  Todday  tomorrow  debt   east
0      Ohio  2019    1.5       5         0   NaN   True
1    Nevada  2020    2.6       4         1   NaN  False
2  New York  2021    1.9       3         2   NaN  False
3    Kansas  2022    9.4       2         3   NaN  False
4     Texas  2023    2.1       1         4   NaN  False

Index(['state', 'year', 'value', 'Todday', 'tomorrow', 'debt'], dtype='object')

In [54]:
"""
Another common form of data is a nested dicts of dicts:

If the nested dict is padded to the DF,
pandas will interpret the outer dict keys as the colums and the inner keys as the row indices:
"""

dict_pop = {'Nevada' : {2001: 2.4, 2002: 2.9},
           "Ohio" :{2000: 1.5, 2001:1.7, 2002: 3.6}}  

dict_frame = pd.DataFrame(dict_pop)

# You can transpose the df (swap rows and columns) with similar syntax to a NumPy array

display(dict_frame.T)

# The keys in the inner dicts are comnined and sorted to form the index in the result.
# This isnt true if an explicit index is specified:

display(pd.DataFrame(dict_pop, index=[2001, 2019, 2022]))

dict_frame.loc[2001]

# Dicts of Series are treated in much the same way:

pdata = {'Ohio': dict_frame['Ohio'][:-1],
        'Nevada': dict_frame['Nevada'][:2]}

display(pdata)

pd.DataFrame(pdata)

#  IF a DF index and colums have their name attrinutes set, these will also be displayed

dict_frame.index.name = 'year'; dict_frame.columns.name = 'state'

display(dict_frame)

# Possible data inputs to DF constructor pages 136

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

      Nevada  Ohio
2001     2.4   1.7
2019     NaN   NaN
2022     NaN   NaN

{'Ohio': 2001    1.7
 2002    3.6
 Name: Ohio, dtype: float64,
 'Nevada': 2001    2.4
 2002    2.9
 Name: Nevada, dtype: float64}

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [74]:
"""
# Index Objects

Pandas Index objects are resposible for holding the axis labels and other metadata
(like the axis name or names).
Any array or other sequence of labels you use when constructing
a Series or DataFrame is internallyconverted to an index:


Some users will not often take advantage of the capabilites provided by indexes

"""

obk = pd.Series(range(3), index=['a', 'b', 'c'])

index = obk.index

display(index)

display(index[1:])

# Index objects are immutable and thus can't be modified by the user
# Immutability makes it safer to share index objectys among data structures.

inx_labels = pd.Index(np.arange(3))

display(inx_labels)

obk2 = pd.Series([1.5, -2.5, 0], index=inx_labels)

display(obk2)

obk2.index is inx_labels

# In addition to being array-like, an Index also bahves like a fixed-size set:

display(dict_frame)

display(dict_frame.columns)

display('Ohio' in dict_frame.columns)

display(2004 in dict_frame.index)

# Unlike Py sets pandas Index can cointain duplicate labelss:

dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

display(dup_labels)

# Some Index methods and properties

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

Int64Index([0, 1, 2], dtype='int64')

0    1.5
1   -2.5
2    0.0
dtype: float64

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

Index(['Nevada', 'Ohio'], dtype='object', name='state')

True

False

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')